# SQL Advanced Assignment

**Name:** Allen Kurt Delos Santos  
**Course & Section:** BSCS-ML - COM221  
**Title:** Advanced SQL Queries and Analysis

---

### **Advanced SQL**

<font color="red">File access required:</font> In Colab this notebook requires first uploading files **Cities.csv**, **Countries.csv**, **Players.csv**, and **Teams.csv** using the *Files* feature in the left toolbar. If running the notebook on a local computer, simply ensure these files are in the same workspace as the notebook.

In [1]:
!pip install prettytable==0.7.2
!pip install ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: prettytable==0.7.2 in c:\users\windows 11\appdata\roaming\python\python312\site-packages (0.7.2)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: ipython-sql in c:\users\windows 11\appdata\roaming\python\python312\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\windows 11\appdata\roaming\python\python312\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython in c:\anaconda3\lib\site-packages (from ipython-sql) (8.27.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\anaconda3\lib\site-packages (from ipython-sql) (2.0.34)
Requirement already satisfied: sqlparse in c:\users\windows 11\appdata\roaming\python\python312\site-packages (from ipython-sql) (0.5.5)
Requirement already satisfied: six in c:\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\windows 11\appdata\roaming\python\python312\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.13.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5.13.0 in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\anaconda3\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: executing in c:\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
# Set-up
%load_ext sql
%sql sqlite://
import pandas as pd

In [3]:
# Create database tables from CSV files
with open('Cities.csv') as f: Cities = pd.read_csv(f, index_col=0)
%sql drop table if exists Cities;
%sql --persist Cities
with open('Countries.csv') as f: Countries = pd.read_csv(f, index_col=0)
%sql drop table if exists Countries;
%sql --persist Countries

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted countries'

#### Look at sample of Cities and Countries tables

In [4]:
%%sql
select * from Cities limit 5

 * sqlite://
Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

In [5]:
%%sql
select * from Countries limit 5

 * sqlite://
Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

### Duplicates, table variables

*Warm-up: Find all cities in the EU with temperature > 15*

In [6]:
%%sql
select city
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes' and temperature > 15

 * sqlite://
Done.

[('Algeciras',),
 ('Athens',),
 ('Badajoz',),
 ('Barcelona',),
 ('Bari',),
 ('Cartagena',),
 ('Catania',),
 ('Cosenza',),
 ('Granada',),
 ('Huelva',),
 ('Kalamata',),
 ('Lisbon',),
 ('Marbella',),
 ('Messina',),
 ('Palermo',),
 ('Patras',),
 ('Pescara',),
 ('Rome',),
 ('Trikala',),
 ('Valencia',)]

*Modify previous query to return EU countries that have a city with temperature > 15, remove duplicates*

*Find number of countries that have a city with latitude > 60 (start with country list then fix)*

In [7]:
%%sql
select country
from Cities
where latitude > 60

 * sqlite://
Done.

[('Sweden',),
 ('Norway',),
 ('Norway',),
 ('Finland',),
 ('Sweden',),
 ('Finland',),
 ('Finland',),
 ('Norway',),
 ('Finland',)]

*Modify first query to use table variables*

In [8]:
%%sql
select city
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes' and temperature > 15

 * sqlite://
Done.

[('Algeciras',),
 ('Athens',),
 ('Badajoz',),
 ('Barcelona',),
 ('Bari',),
 ('Cartagena',),
 ('Catania',),
 ('Cosenza',),
 ('Granada',),
 ('Huelva',),
 ('Kalamata',),
 ('Lisbon',),
 ('Marbella',),
 ('Messina',),
 ('Palermo',),
 ('Patras',),
 ('Pescara',),
 ('Rome',),
 ('Trikala',),
 ('Valencia',)]

*Find all pairs of cities with the same longitude; return the city pairs and their (shared) longitude - notice what's wrong and fix it*

In [9]:
%%sql
select C1.city, C2.city, C1.longitude
from Cities C1, Cities C2
where C1.longitude = C2.longitude

 * sqlite://
Done.

[('Aalborg', 'Aalborg', 9.92),
 ('Aberdeen', 'Aberdeen', -2.08),
 ('Abisko', 'Abisko', 18.83),
 ('Adana', 'Adana', 35.32),
 ('Albacete', 'Albacete', -1.87),
 ('Algeciras', 'Algeciras', -5.47),
 ('Amiens', 'Amiens', 2.3),
 ('Amsterdam', 'Amsterdam', 4.92),
 ('Ancona', 'Ancona', 13.5),
 ('Andorra', 'Andorra', 1.52),
 ('Angers', 'Angers', -0.53),
 ('Ankara', 'Ankara', 32.86),
 ('Antalya', 'Antalya', 30.7),
 ('Arad', 'Arad', 21.32),
 ('Athens', 'Athens', 23.73),
 ('Augsburg', 'Augsburg', 10.9),
 ('Bacau', 'Bacau', 26.92),
 ('Badajoz', 'Badajoz', -6.97),
 ('Baia Mare', 'Baia Mare', 23.58),
 ('Balti', 'Balti', 27.91),
 ('Barcelona', 'Barcelona', 2.18),
 ('Bari', 'Bari', 16.87),
 ('Basel', 'Basel', 7.59),
 ('Batman', 'Batman', 41.14),
 ('Belfast', 'Belfast', -5.96),
 ('Belgrade', 'Belgrade', 20.47),
 ('Bergamo', 'Bergamo', 9.67),
 ('Bergen', 'Bergen', 5.32),
 ('Berlin', 'Berlin', 13.4),
 ('Bialystok', 'Bialystok', 23.17),
 ('Bielefeld', 'Bielefeld', 8.53),
 ('Bila Tserkva', 'Bila Tserkva', 30.13),
 ('Bilbao', 'Bilbao', -2.93),
 ('Birmingham', 'Birmingham', -1.92),
 ('Blackpool', 'Blackpool', -3.05),
 ('Bodo', 'Bodo', 14.4),
 ('Bologna', 'Bologna', 11.34),
 ('Bonn', 'Bonn', 7.08),
 ('Bordeaux', 'Bordeaux', -0.6),
 ('Botosani', 'Botosani', 26.66),
 ('Bournemouth', 'Bournemouth', -1.9),
 ('Bradford', 'Bradford', -1.75),
 ('Braga', 'Braga', -8.42),
 ('Braila', 'Braila', 27.97),
 ('Bratislava', 'Bratislava', 17.12),
 ('Bremen', 'Bremen', 8.8),
 ('Brest', 'Brest', -4.5),
 ('Brest', 'Brest', 23.7),
 ('Brno', 'Brno', 16.61),
 ('Brugge', 'Brugge', 3.23),
 ('Bucharest', 'Bucharest', 26.1),
 ('Budapest', 'Budapest', 19.08),
 ('Burgas', 'Burgas', 27.47),
 ('Burgos', 'Burgos', -3.68),
 ('Burgos', 'Madrid', -3.68),
 ('Bursa', 'Bursa', 29.07),
 ('Bydgoszcz', 'Bydgoszcz', 18.01),
 ('Bytom', 'Bytom', 18.91),
 ('Caen', 'Caen', -0.35),
 ('Cambridge', 'Cambridge', 0.12),
 ('Cartagena', 'Cartagena', -0.98),
 ('Catania', 'Catania', 15.08),
 ('Chemnitz', 'Chemnitz', 12.92),
 ('Cherkasy', 'Cherkasy', 32.07),
 ('Chernihiv', 'Chernihiv', 31.3),
 ('Chernivtsi', 'Chernivtsi', 25.92),
 ('Chisinau', 'Chisinau', 28.86),
 ('Constanta', 'Constanta', 28.61),
 ('Cork', 'Cork', -8.5),
 ('Cosenza', 'Cosenza', 16.29),
 ('Craiova', 'Craiova', 23.83),
 ('Craiova', 'Hrodna', 23.83),
 ('Daugavpils', 'Daugavpils', 26.51),
 ('Debrecen', 'Debrecen', 21.63),
 ('Denizli', 'Denizli', 29.08),
 ('Dijon', 'Dijon', 5.03),
 ('Dublin', 'Dublin', -6.25),
 ('Dundee', 'Dundee', -3.0),
 ('Edinburgh', 'Edinburgh', -3.22),
 ('Edirne', 'Edirne', 26.57),
 ('Elbasan', 'Elbasan', 20.08),
 ('Elblag', 'Elblag', 19.4),
 ('Erfurt', 'Erfurt', 11.03),
 ('Erzincan', 'Erzincan', 39.49),
 ('Erzurum', 'Erzurum', 41.29),
 ('Eskisehir', 'Eskisehir', 30.53),
 ('Exeter', 'Exeter', -3.53),
 ('Foggia', 'Foggia', 15.56),
 ('Frankfurt', 'Frankfurt', 8.68),
 ('Freiburg', 'Freiburg', 7.87),
 ('Galway', 'Galway', -9.05),
 ('Gaziantep', 'Gaziantep', 37.38),
 ('Geneva', 'Geneva', 6.14),
 ('Genoa', 'Genoa', 8.93),
 ('Glasgow', 'Glasgow', -4.25),
 ('GÃ¶teborg', 'GÃ¶teborg', 12.0),
 ('Granada', 'Granada', -3.59),
 ('Graz', 'Graz', 15.41),
 ('Grenoble', 'Grenoble', 5.72),
 ('Groningen', 'Groningen', 6.58),
 ('Gyor', 'Gyor', 17.63),
 ('Heidelberg', 'Heidelberg', 8.7),
 ('Helsinki', 'Helsinki', 24.93),
 ('Horlivka', 'Horlivka', 38.05),
 ('Hrodna', 'Craiova', 23.83),
 ('Hrodna', 'Hrodna', 23.83),
 ('Huelva', 'Huelva', -6.93),
 ('Ingolstadt', 'Ingolstadt', 11.45),
 ('Innsbruck', 'Innsbruck', 11.41),
 ('Inverness', 'Inverness', -4.23),
 ('Istanbul', 'Istanbul', 29.01),
 ('Kalamata', 'Kalamata', 22.11),
 ('Karaman', 'Karaman', 33.22),
 ('Karlsruhe', 'Karlsruhe', 8.4),
 ('Kaunas', 'Kaunas', 23.88),
 ('Kayseri', 'Kayseri', 35.49),
 ('Kherson', 'Kherson', 32.6),
 ('Kielce', 'Kielce', 20.66),
 ('Kiev', 'Kiev', 30.52),
 ('Kiruna', 'Kiruna', 20.22),
 ('Klaipeda', 'Klaipeda', 21.12),
 ('Kosice', 'Kosice', 21.25),
 ('Koszalin', 'Koszalin', 16.18),
 ('Kremenchuk', 'Kremenchuk', 33.43),
 ('Kryvyy Rih', 'Kryvyy Rih', 33.34),
 ('Le Mans', 'Le Mans', 0.1),
 ('Lille', 'Lille', 3.08),
 ('Limoges', 'Limoges', 1.25),
 ('Linz', 'Linz', 14.29),
 ('Lisbon', 'Lisbon', -9.14),
 ('Ljubljana', 'Ljubljana', 14.51),
 ('Lvov', 'Lvov', 24.03),
 ('Maastricht', 'Maastricht', 5.68),
 ('Maastricht', 'Stavanger', 5.68),
 ('Madrid', 'Burgos', -3.68),
 ('Madrid', 'Madrid', -3.68),
 ('Magdeburg', 'Magdeburg', 11.62),
 ('Makiyivka', 'Makiyivka', 37.97),
 ('Malatya', 'Malatya', 38.3),
 ('MalmÃ¶', 'MalmÃ¶', 13.03),
 ('Manisa', 'Manisa', 27.44),
 ('Marbella', 'Marbella', -4.88),
 ('Marseille', 'Marseille', 5.38),
 ('Mazyr', 'Mazyr', 29.27),
 ('Messina', 'Messina', 15.55),
 ('Metz', 'Metz', 6.18),
 ('Milan', 'Milan', 9.21),
 ('Minsk', 'Minsk', 27.57),
 ('Montpellier', 'Montpellier', 3.87),
 ('Mulhouse', 'Mulhouse', 7.35),
 ('Murcia', 'Murcia', -1.13),
 ('Nice', 'Nice', 7.27),
 ('Nis', 'Nis', 21.9),
 ('Novi Sad', 'Novi Sad', 19.85),
 ('Odense', 'Odense', 10.38),
 ('Ordu', 'Ordu', 37.87),
 ('Orsha', 'Orsha', 30.42),
 ('Oslo', 'Oslo', 10.75),
 ('Ostrava', 'Ostrava', 18.25),
 ('Oulu', 'Oulu', 25.47),
 ('Oviedo', 'Oviedo', -5.83),
 ('Palermo', 'Palermo', 13.35),
 ('Patras', 'Patras', 21.73),
 ('Perpignan', 'Perpignan', 2.9),
 ('Perugia', 'Perugia', 12.39),
 ('Pescara', 'Pescara', 14.22),
 ('Pinsk', 'Pinsk', 26.09),
 ('Pleven', 'Pleven', 24.61),
 ('Plovdiv', 'Plovdiv', 24.75),
 ('Podgorica', 'Podgorica', 19.27),
 ('Poznan', 'Poznan', 16.9),
 ('Prague', 'Prague', 14.47),
 ('Reims', 'Reims', 4.03),
 ('Riga', 'Riga', 24.1),
 ('Rijeka', 'Rijeka', 14.45),
 ('Rivne', 'Rivne', 26.25),
 ('Rome', 'Rome', 12.48),
 ('Rostock', 'Rostock', 12.15),
 ('Ruse', 'Ruse', 25.97),
 ('Salamanca', 'Salamanca', -5.67),
 ('Salzburg', 'Salzburg', 13.04),
 ('Samsun', 'Samsun', 36.34),
 ('Santander', 'Santander', -3.8),
 ('Sarajevo', 'Sarajevo', 13.38),
 ('Sibiu', 'Sibiu', 24.14),
 ('Siirt', 'Siirt', 41.93),
 ('Sivas', 'Sivas', 37.03),
 ('Skopje', 'Skopje', 21.43),
 ('Split', 'Split', 16.47),
 ('Stara Zagora', 'Stara Zagora', 25.62),
 ('Stavanger', 'Maastricht', 5.68),
 ('Stavanger', 'Stavanger', 5.68),
 ('Stockholm', 'Stockholm', 18.1),
 ('Sumy', 'Sumy', 34.78),
 ('Swansea', 'Swansea', -3.95),
 ('Szeged', 'Szeged', 20.15),
 ('Tallinn', 'Tallinn', 24.73),
 ('Tampere', 'Tampere', 23.75),
 ('Tarsus', 'Tarsus', 34.88),
 ('Tartu', 'Tartu', 26.71),
 ('Tekirdag', 'Tekirdag', 27.51),
 ('Toulouse', 'Toulouse', 1.45),
 ('Trabzon', 'Trabzon', 39.72),
 ('Trieste', 'Trieste', 13.8),
 ('Trikala', 'Trikala', 21.77),
 ('Trondheim', 'Trondheim', 10.42),
 ('Turku', 'Turku', 22.25),
 ('Uppsala', 'Uppsala', 17.64),
 ('Valencia', 'Valencia', -0.4),
 ('Vienna', 'Vienna', 16.37),
 ('Vigo', 'Vigo', -8.73),
 ('Vilnius', 'Vilnius', 25.32),
 ('Warsaw', 'Warsaw', 21.0),
 ('Wroclaw', 'Wroclaw', 17.03),
 ('Yevpatoriya', 'Yevpatoriya', 33.36),
 ('Zaragoza', 'Zaragoza', -0.89),
 ('Zhytomyr', 'Zhytomyr', 28.66),
 ('Zonguldak', 'Zonguldak', 31.78),
 ('Zurich', 'Zurich', 8.56)]

*Find all pairs of cities that are near each other, i.e., longitude and latitude are both less than 0.5 apart; return city pairs*

In [10]:
%%sql
select C1.city, C2.city
from Cities C1, Cities C2
where abs(C1.longitude - C2.longitude) < .5
and abs(C1.latitude - C2.latitude) < .5
and C1.city < C2.city

 * sqlite://
Done.

[('Adana', 'Tarsus'),
 ('Ancona', 'Sarajevo'),
 ('Basel', 'Freiburg'),
 ('Basel', 'Mulhouse'),
 ('Bergamo', 'Milan'),
 ('Cartagena', 'Murcia'),
 ('Heidelberg', 'Karlsruhe'),
 ('Horlivka', 'Makiyivka')]

### <font color = 'green'>**Your Turn**</font>

*Find all pairs of cities with the same temperature. Return the city pairs along with their shared temperature. What do you think about the data after seeing the answer?*

In [11]:
%%sql
select C1.city as city1, C2.city as city2, C1.temperature
from Cities C1, Cities C2
where C1.temperature = C2.temperature
and C1.city < C2.city

 * sqlite://
Done.

[('Andorra', 'Sarajevo', 9.6),
 ('Augsburg', 'Innsbruck', 4.54),
 ('Baia Mare', 'Debrecen', 8.87),
 ('Balti', 'Botosani', 8.23),
 ('Basel', 'Elblag', 6.68),
 ('Basel', 'Freiburg', 6.68),
 ('Basel', 'Mulhouse', 6.68),
 ('Basel', 'Zurich', 6.68),
 ('Bialystok', 'Hrodna', 6.07),
 ('Bonn', 'Maastricht', 8.63),
 ('Bratislava', 'Brugge', 9.65),
 ('Bratislava', 'Gyor', 9.65),
 ('Bratislava', 'Lille', 9.65),
 ('Brno', 'Vienna', 7.86),
 ('Brugge', 'Gyor', 9.65),
 ('Brugge', 'Lille', 9.65),
 ('Bucharest', 'Le Mans', 10.59),
 ('Bucharest', 'Ruse', 10.59),
 ('Bytom', 'Ostrava', 7.66),
 ('Chemnitz', 'Prague', 8.05),
 ('Chemnitz', 'Sivas', 8.05),
 ('Chisinau', 'Glasgow', 8.6),
 ('Craiova', 'Pleven', 10.51),
 ('Daugavpils', 'Vilnius', 5.38),
 ('Edinburgh', 'Kremenchuk', 7.43),
 ('Edirne', 'Stara Zagora', 10.9),
 ('Elblag', 'Freiburg', 6.68),
 ('Elblag', 'Mulhouse', 6.68),
 ('Elblag', 'Zurich', 6.68),
 ('Eskisehir', 'Montpellier', 11.11),
 ('Freiburg', 'Mulhouse', 6.68),
 ('Freiburg', 'Zurich', 6.68),
 ('Geneva', 'Grenoble', 8.4),
 ('Gyor', 'Lille', 9.65),
 ('Karlsruhe', 'Metz', 8.88),
 ('Koszalin', 'Odense', 7.73),
 ('Le Mans', 'Ruse', 10.59),
 ('Ljubljana', 'Rijeka', 9.27),
 ('Manisa', 'Rome', 15.1),
 ('Mulhouse', 'Zurich', 6.68),
 ('Nis', 'Skopje', 9.36),
 ('Novi Sad', 'Szeged', 10.34),
 ('Prague', 'Sivas', 8.05),
 ('Tarsus', 'Trieste', 11.21)]

### Subqueries in Where clause

*Find all countries in the Countries table with no city in the Cities table*

In [12]:
%%sql
select country
from Countries
where not exists (

  select * from Cities
  where Cities.country = Countries.country

)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

*Find countries in the EU that have a city with temperature > 15*

In [13]:
%%sql
select country
from Countries
where EU = 'yes'
and exists (select * from Cities
            where Cities.country = Countries.country
            and temperature > 15)

 * sqlite://
Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

*Find number of countries that have a city with latitude > 60 (start with country list)*

In [14]:
%%sql
-- To get the number, wrap the query with COUNT
select count(*) as num_countries
from Countries
where exists (select * from Cities
              where Cities.country = Countries.country
              and latitude > 60)

 * sqlite://
Done.

[(3,)]

*Find the westernmost city; return the city and longitude*

In [15]:
%%sql
select city, longitude
from Cities C1
where not exists (select * from Cities C2
                  where C2.longitude < C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14)]

In [16]:
%%sql
-- Modified to include both westernmost AND easternmost
select city, longitude
from Cities C1
where not exists (select * from Cities C2
                  where C2.longitude < C1.longitude)
OR not exists (select * from Cities C2
               where C2.longitude > C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14), ('Siirt', 41.93)]

*Add easternmost to previous query*

*Westernmost city query using = and min*

In [17]:
%%sql
select city, longitude
from Cities
where longitude = (select min(longitude) from Cities)

 * sqlite://
Done.

[('Lisbon', -9.14)]

*Find all cities whose temperature is more than 50% higher than the average; return the city, country, and temperature, ordered by descending temperature*

In [18]:
%%sql
select city, country, temperature
from Cities
where temperature > (select avg(temperature) * 1.5 from Cities)
order by temperature desc

 * sqlite://
Done.

[('Adana', 'Turkey', 18.67),
 ('Palermo', 'Italy', 17.9),
 ('Athens', 'Greece', 17.41),
 ('Algeciras', 'Spain', 17.38),
 ('Cartagena', 'Spain', 17.32),
 ('Kalamata', 'Greece', 17.3),
 ('Marbella', 'Spain', 17.19),
 ('Huelva', 'Spain', 17.09),
 ('Patras', 'Greece', 16.9),
 ('Cosenza', 'Italy', 16.6),
 ('Messina', 'Italy', 16.54),
 ('Granada', 'Spain', 16.33),
 ('Valencia', 'Spain', 16.02),
 ('Trikala', 'Greece', 16.0),
 ('Barcelona', 'Spain', 15.78),
 ('Badajoz', 'Spain', 15.61),
 ('Lisbon', 'Portugal', 15.52),
 ('Elbasan', 'Albania', 15.18),
 ('Bari', 'Italy', 15.15),
 ('Pescara', 'Italy', 15.13),
 ('Manisa', 'Turkey', 15.1),
 ('Rome', 'Italy', 15.1),
 ('Catania', 'Italy', 15.04),
 ('Denizli', 'Turkey', 15.02),
 ('Murcia', 'Spain', 15.0),
 ('Marseille', 'France', 14.98)]

*Number of cities in the EU*

In [19]:
%%sql
select count()
from Cities
where country in (select country from Countries where EU = 'yes')

 * sqlite://
Done.

[(150,)]

*Modify previous query to use "not in"*

*Same query using join instead of subquery*

In [20]:
%%sql
select count()
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes'

 * sqlite://
Done.

[(150,)]

*Number of countries with no coastline and a city with longitude < 20*

In [21]:
%%sql
select count()
from Countries
where coastline = 'no'
and exists (select * from Cities where country = Countries.country
            and longitude < 20)

 * sqlite://
Done.

[(7,)]

*Same query using join instead of subquery (see what's wrong and fix it)*

In [22]:
%%sql
select count()
from Countries, Cities
where Countries.country = Cities.country
and coastline = 'no' and longitude < 20

 * sqlite://
Done.

[(16,)]

*Find countries in Countries table with no city in Cities table using join instead of subquery (subquery version repeated first)*

In [23]:
%%sql
select country
from Countries
where not exists (select * from Cities
                  where Cities.country = Countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

In [24]:
%%sql
select distinct Countries.country
from Countries left join Cities
on Countries.country = Cities.country
where Cities.country is null

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

### <font color = 'green'>**Your Turn**</font>

*Find all cities in a country whose population is < 2; return the city and country. First write the query without a subquery.*

In [32]:
%%sql
select city, Cities.country
from Cities
join Countries on Cities.country = Countries.country
where population < 2

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Now write the same query using a subquery instead of a join.*

In [25]:
%%sql
select city, country
from Cities
where country in (select country from Countries where population < 2)

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Find all countries with no city having a temperature > 6*

In [26]:
%%sql
select country
from Countries
where not exists (select * from Cities
                  where Cities.country = Countries.country
                  and temperature > 6)

 * sqlite://
Done.

[('Cyprus',),
 ('Estonia',),
 ('Finland',),
 ('Iceland',),
 ('Kosovo',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Norway',)]

*Now try to write the same query without a subquery; can you?*

In [27]:
%%sql
select c.country
from Countries c
left join Cities ci on c.country = ci.country
group by c.country
having max(ci.temperature) <= 6 or max(ci.temperature) is null

 * sqlite://
Done.

[('Cyprus',),
 ('Estonia',),
 ('Finland',),
 ('Iceland',),
 ('Kosovo',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Norway',)]

### Aggregation with Having clause

*Find all countries with average city temperature > 10; return country and average temperature*

In [28]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > 10

 * sqlite://
Done.

[('Albania', 15.18),
 ('Bulgaria', 10.440000000000001),
 ('Croatia', 10.865),
 ('France', 10.151111111111112),
 ('Greece', 16.9025),
 ('Italy', 13.474666666666668),
 ('Portugal', 14.469999999999999),
 ('Spain', 14.238333333333335),
 ('Turkey', 11.726666666666667)]

*Find all countries with more than 5 cities above latitude 50*

In [29]:
%%sql
select country
from Cities
where latitude > 50
group by country
having count() > 5

 * sqlite://
Done.

[('Belarus',), ('Germany',), ('Poland',), ('Sweden',), ('United Kingdom',)]

*Same query without Having clause*

In [30]:
%%sql
select distinct country
from Cities C1
where 5 < (select count() from Cities C2
           where C1.country=C2.country
           and latitude > 50)

 * sqlite://
Done.

[('United Kingdom',), ('Sweden',), ('Germany',), ('Poland',), ('Belarus',)]

*Which combinations of EU versus non-EU and coastline versus no-coastline have a minimum population greater than 0.5?*

In [31]:
%%sql
select EU, coastline, min(population)
from Countries
group by EU, coastline
having min(population) > 0.5

 * sqlite://
Done.

[('yes', 'no', 0.58), ('yes', 'yes', 1.18)]

*Find all countries with average city temperature more than 50% higher than the overall average; return country and average temperature*

In [32]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > (select 1.5 * avg(temperature) from Cities)

 * sqlite://
Done.

[('Albania', 15.18), ('Greece', 16.9025), ('Portugal', 14.469999999999999)]

### <font color = 'green'>**Your Turn**</font>

*Find all countries whose average city longitude is lower than the overall average longitude, and whose average city latitude is higher than the overall average latitude. Return the countries. Note: Yes, you can use "and" in Having clauses!*

In [33]:
%%sql
select country
from Cities
group by country
having avg(longitude) < (select avg(longitude) from Cities)
and avg(latitude) > (select avg(latitude) from Cities)

 * sqlite://
Done.

[('Austria',),
 ('Belgium',),
 ('Denmark',),
 ('Germany',),
 ('Ireland',),
 ('Netherlands',),
 ('Norway',),
 ('United Kingdom',)]

### Subqueries in From and Select clauses

*Find all countries with both cold and warm cities -- at least one city with temperature < 9 and one city with temperature > 14*

In [34]:
%%sql
select distinct C1.country
from Cities C1, Cities C2
where C1.country = C2.country
and C1.temperature < 9 and C2.temperature > 14

 * sqlite://
Done.

[('France',), ('Turkey',), ('Italy',)]

*Modify query to also return count of cold and warm cities (then show without column renaming)*

In [35]:
# (select count() from Cities where country = C1.country and temperature < 9) as numcold,
# (select count() from Cities where country = C1.country and temperature > 14) as numwarm

*Same query using subquery in From clause instead of Select clause*

In [36]:
%%sql
select Cold.country, numcold, numwarm
from (select country, count() as numcold from Cities
      where temperature < 9 group by country) Cold,
     (select country, count() as numwarm from Cities
      where temperature > 14 group by country) Warm
where Cold.country = Warm.country

 * sqlite://
Done.

[('France', 5, 1), ('Italy', 1, 7), ('Turkey', 4, 5)]

### Data modification

*Increase all city temperatures by 10%*

In [37]:
%%sql
update Cities
set temperature = 1.1 * temperature

 * sqlite://
213 rows affected.

[]

In [38]:
%%sql
select avg(temperature) from Cities

 * sqlite://
Done.

[(10.44762441314554,)]

*Increase temperatures another 10% for cities in countries with coastline*

In [39]:
%%sql
update Cities
set temperature = 1.1 * temperature
where country in (select country from Countries
                  where coastline = 'yes')

 * sqlite://
183 rows affected.

[]

*Delete all cities in Turkey*

In [40]:
%%sql
delete from Cities
where country = 'Turkey'

 * sqlite://
24 rows affected.

[]

*Create a new table NonEU containing list of cities (with country) not in the EU*

In [41]:
%%sql
drop table if exists NonEU;
create table NonEU(city, country);
insert into NonEU
  select city, country from cities
  where country in (select country from Countries
                    where EU = 'no');
select * from NonEU

 * sqlite://
Done.
Done.
39 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland')]

*Add your city*

In [42]:
%%sql
insert into NonEU values ('Silang','Philippines');
select * from NonEU

 * sqlite://
1 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland'),
 ('Silang', 'Philippines')]

### <font color = 'green'>**Your Turn - Advanced SQL on World Cup Data**</font>

In [43]:
# Create database tables from CSV files
with open('Players.csv') as f: Players = pd.read_csv(f, index_col=0)
%sql drop table if exists Players;
%sql --persist Players
with open('Teams.csv') as f: Teams = pd.read_csv(f, index_col=0)
%sql drop table if exists Teams;
%sql --persist Teams

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted teams'

#### Look at sample of Players and Teams tables

In [44]:
%%sql
select * from Players limit 5

 * sqlite://
Done.

[('Abdoun', 'Algeria', 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 'goalkeeper', 90, 0, 17, 0, 2)]

In [45]:
%%sql
select * from Teams limit 5

 * sqlite://
Done.

[('Brazil', 1, 5, 3, 1, 1, 9, 4, 7, 2),
 ('Spain', 2, 6, 5, 0, 1, 7, 2, 3, 0),
 ('Portugal', 3, 4, 1, 2, 1, 7, 1, 8, 1),
 ('Netherlands', 4, 6, 6, 0, 0, 12, 5, 15, 0),
 ('Italy', 5, 3, 0, 2, 1, 4, 5, 5, 0)]

*1) Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

In [46]:
%%sql
select T1.team, T2.team, T1.goalsFor, T1.goalsAgainst
from Teams T1, Teams T2
where T1.goalsFor = T2.goalsFor
and T1.goalsAgainst = T2.goalsAgainst
and T1.team < T2.team

 * sqlite://
Done.

[('Italy', 'Mexico', 4, 5),
 ('England', 'Nigeria', 3, 5),
 ('England', 'South Africa', 3, 5),
 ('Chile', 'England', 3, 5),
 ('Chile', 'Nigeria', 3, 5),
 ('Chile', 'South Africa', 3, 5),
 ('Cameroon', 'Greece', 2, 5),
 ('Australia', 'Denmark', 3, 6),
 ('Nigeria', 'South Africa', 3, 5)]

*2) Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

In [47]:
%%sql
select team, ranking
from Teams
where ranking < 30
and not exists (select * from Players
                where Players.team = Teams.team
                and passes > 150)

 * sqlite://
Done.

[('France', 9), ('Nigeria', 21), ('Switzerland', 24)]

*3) Which players made more shots than 5x the overall average number of shots? Return the player surname, position, and team.*

In [48]:
%%sql
select surname, position, team
from Players
where shots > (select 5 * avg(shots) from Players)

 * sqlite://
Done.

[('Higuain', 'forward', 'Argentina'),
 ('Messi', 'forward', 'Argentina'),
 ('Podolski', 'forward', 'Germany'),
 ('Boateng', 'midfielder', 'Ghana'),
 ('Gyan', 'forward', 'Ghana'),
 ('Sneijder', 'midfielder', 'Netherlands'),
 ('van Persie', 'forward', 'Netherlands'),
 ('Jong Tae-Se', 'forward', 'North Korea'),
 ('Ronaldo', 'forward', 'Portugal'),
 ('Park Chu-Young', 'forward', 'South Korea'),
 ('Villa', 'forward', 'Spain'),
 ('Forlan', 'forward', 'Uruguay'),
 ('Suarez', 'forward', 'Uruguay'),
 ('Dempsey', 'midfielder', 'USA')]

*4) Find all team-position pairs where the average number of passes made by players in that position on that team is greater than 150. Return the team-position pairs.*

In [49]:
%%sql
select team, position
from Players
group by team, position
having avg(passes) > 150

 * sqlite://
Done.

[('Argentina', 'midfielder'),
 ('Brazil', 'defender'),
 ('Germany', 'defender'),
 ('Germany', 'midfielder'),
 ('Ghana', 'midfielder'),
 ('Mexico', 'defender'),
 ('Netherlands', 'defender'),
 ('Netherlands', 'midfielder'),
 ('Spain', 'defender'),
 ('Spain', 'midfielder')]

*5) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

In [51]:
%%sql
select team, avg(passes) as avg_passes
from Players
where position = 'defender'
group by team
having avg(passes) > 150
order by avg_passes DESC

 * sqlite://
Done.

[('Spain', 213.0),
 ('Brazil', 190.0),
 ('Germany', 189.83333333333334),
 ('Netherlands', 182.5),
 ('Mexico', 152.14285714285714)]

### <font color = 'green'>**Your Turn Extra - Advanced SQL on Titanic Data**</font>

<font color="red">File access required:</font> In Colab these extra problems require first uploading **Titanic.csv** using the *Files* feature in the left toolbar. If running the notebook on a local computer, simply ensure this file is in the same workspace as the notebook.

In [52]:
# Load dataabase table from CSV file
with open('Titanic.csv') as f: Titanic = pd.read_csv(f, index_col=0)
%sql drop table if exists Titanic;
%sql --persist Titanic

 * sqlite://
Done.
 * sqlite://

'Persisted titanic'

#### Look at sample of Titanic table

In [53]:
%%sql
select * from Titanic limit 5

 * sqlite://
Done.

[('Abbing', 'Mr. Anthony', 'M', 42.0, 3, 7.55, 'Southampton', 'no'),
 ('Abbott', 'Mrs. Stanton (Rosa Hunt)', 'F', 35.0, 3, 20.25, 'Southampton', 'yes'),
 ('Abbott', 'Mr. Rossmore Edward', 'M', 16.0, 3, 20.25, 'Southampton', 'no'),
 ('Abelson', 'Mr. Samuel', 'M', 30.0, 2, 24.0, 'Cherbourg', 'no'),
 ('Abelson', 'Mrs. Samuel (Hannah Wizosky)', 'F', 28.0, 2, 24.0, 'Cherbourg', 'yes')]

*1) Find pairs of passengers who are likely to be twin children: same last name, same age, same embarkation, and age is under 18. Return each pair once, including their last name, first names, age, and embarkation city.*

In [54]:
%%sql
select T1.last, T1.first, T2.first, T1.age, T1.embarked
from Titanic T1, Titanic T2
where T1.last = T2.last
and T1.age = T2.age
and T1.embarked = T2.embarked
and T1.age < 18
and T1.first < T2.first

 * sqlite://
Done.

[('Baclini', 'Miss Eugenie', 'Miss Helene Barbara', 0.75, 'Cherbourg'),
 ('Calic', 'Mr. Jovo', 'Mr. Petar', 17.0, 'Southampton')]

*2) Which embarkation cities have more than 40 passengers whose age is missing? Reminder: Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value.*

In [55]:
%%sql
select embarked
from Titanic
where age is null
group by embarked
having count(*) > 40

 * sqlite://
Done.

[('Queenstown',), ('Southampton',)]

*3) Find all classes where the average fare paid by passengers in that class was more than twice the overall average or less than half the overall average.*

In [56]:
%%sql
select class
from Titanic
group by class
having avg(fare) > (select 2 * avg(fare) from Titanic)
or avg(fare) < (select 0.5 * avg(fare) from Titanic)

 * sqlite://
Done.

[(1,), (3,)]

*4) What is the average number of passengers per last name? Hint: Requires using a subquery in the From clause*

In [57]:
%%sql
select avg(passenger_count) as avg_passengers_per_lastname
from (select last, count(*) as passenger_count
      from Titanic
      group by last)

 * sqlite://
Done.

[(1.3358320839580209,)]

*5) List each class and its survival rate, i.e., the fraction of passengers in that class who survived. Hints: Use subqueries in the From clause to compute the number of survivers per class and total passengers per class, and force floating point division by multiplying one operand by 1.0*

In [58]:
%%sql
select S.class, (S.survivors * 1.0 / T.total) as survival_rate
from (select class, count(*) as survivors
      from Titanic
      where survived = 'yes'
      group by class) S,
     (select class, count(*) as total
      from Titanic
      group by class) T
where S.class = T.class

 * sqlite://
Done.

[(1, 0.6296296296296297), (2, 0.47282608695652173), (3, 0.24236252545824846)]

*6) Modify your previous query to return the survival rate by gender, i.e., of females and of males.*

In [59]:
%%sql
select S.gender, (S.survivors * 1.0 / T.total) as survival_rate
from (select gender, count(*) as survivors
      from Titanic
      where survived = 'yes'
      group by gender) S,
     (select gender, count(*) as total
      from Titanic
      group by gender) T
where S.gender = T.gender

 * sqlite://
Done.

[('F', 0.7420382165605095), ('M', 0.18890814558058924)]

*7) Now return the survival rate of children versus adults, i.e., of passengers under age 18 versus those 18 or over (ignoring passengers whose age is missing).*

In [60]:
%%sql
select S.age_group, (S.survivors * 1.0 / T.total) as survival_rate
from (select case when age < 18 then 'Child' else 'Adult' end as age_group,
             count(*) as survivors
      from Titanic
      where survived = 'yes' and age is not null
      group by age_group) S,
     (select case when age < 18 then 'Child' else 'Adult' end as age_group,
             count(*) as total
      from Titanic
      where age is not null
      group by age_group) T
where S.age_group = T.age_group

 * sqlite://
Done.

[('Adult', 0.3810316139767055), ('Child', 0.5398230088495575)]

### <font color = 'green'>**Your Turn Extra - SQL Data Modification on Titanic Data**</font>

In [61]:
# Reload table from CSV file
# NOTE: You may want to reload frequently to reset the data as you
# experiment with modifications
with open('Titanic.csv') as f: Titanic = pd.read_csv(f, index_col=0)
%sql drop table if exists Titanic;
%sql --persist Titanic

 * sqlite://
Done.
 * sqlite://

'Persisted titanic'

*1) Subtract 5 from the fare paid by any passenger under the age of 10. Then compute the new average fare. NOTE: You can put multiple SQL statements in one cell separated by a semicolon.*

In [62]:
%%sql
update Titanic
set fare = fare - 5
where age < 10;

select avg(fare) as new_avg_fare from Titanic

 * sqlite://
62 rows affected.
Done.

[(31.857093153759823,)]

*2) Create a new table called Survivors, containing the last and first names of all passengers who survived. Then count the number of tuples in the new table.*

In [63]:
%%sql
drop table if exists Survivors;
create table Survivors(last, first);
insert into Survivors
  select last, first from Titanic
  where survived = 'yes';

select count(*) as survivor_count from Survivors

 * sqlite://
Done.
Done.
342 rows affected.
Done.

[(342,)]

*3) In the Titanic table delete all but the highest-paying passengers.*

In [64]:
%%sql
delete from Titanic
where fare < (select max(fare) from Titanic);

select count(*) as remaining_passengers from Titanic

 * sqlite://
888 rows affected.
Done.

[(3,)]

*4) In what's left of the table after (3), insert a new tuple for yourself. You can decide your class, fare, where you embarked, and whether you survived. Then show the whole table.*

In [65]:
%%sql
insert into Titanic values ('Delos Santos', 'Allen Kurt', 'M', 20, 3, 100.0, 'Southampton', 'yes');

select * from Titanic

 * sqlite://
1 rows affected.
Done.

[('Cardeza', 'Mr. Thomas Drake Martinez', 'M', 36.0, 1, 512.33, 'Cherbourg', 'yes'),
 ('Lesurer', 'Mr. Gustave J', 'M', 35.0, 1, 512.33, 'Cherbourg', 'yes'),
 ('Ward', 'Miss Anna', 'F', 35.0, 1, 512.33, 'Cherbourg', 'yes'),
 ('Delos Santos', 'Allen Kurt', 'M', 20.0, 3, 100.0, 'Southampton', 'yes')]